In [1]:
import pandas as pd
df = pd.read_excel('/Users/zaha/Documents/shop_list.xls', header=0, sep= '\t')

In [2]:
df.dtypes

Name_shop     object
Date_start    object
City          object
Format        object
SKU_Count      int64
dtype: object

In [3]:
df

       Name_shop  Date_start       City          Format  SKU_Count
0  Стремительный  12.03.2000    Москва              NaN       1300
1    Хрустальный  07.08.1999  Волгоград  Магазин у дома       1000
2     Турбуленый  13.02.2000  Краснодар     Гипермаркет       3000
3        Опасный  15.04.2005  Краснодар             NaN       1300
4        Полдний  19.11.2005     Москва  Магазин у дома       1000
5   Колоссальный  31.05.2005     Москва       Косметика       1500
6      Правдивый  28.04.2014     Москва             NaN       1300

In [5]:
df.Date_start = df.Date_start.apply((pd.to_datetime))
# Переводим стобец дата старт в формат дата тайм

In [6]:
df

       Name_shop Date_start       City          Format  SKU_Count
0  Стремительный 2000-12-03    Москва              NaN       1300
1    Хрустальный 1999-07-08  Волгоград  Магазин у дома       1000
2     Турбуленый 2000-02-13  Краснодар     Гипермаркет       3000
3        Опасный 2005-04-15  Краснодар             NaN       1300
4        Полдний 2005-11-19     Москва  Магазин у дома       1000
5   Колоссальный 2005-05-31     Москва       Косметика       1500
6      Правдивый 2014-04-28     Москва             NaN       1300

In [8]:
df.dtypes

Name_shop             object
Date_start    datetime64[ns]
City                  object
Format                object
SKU_Count              int64
dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
Name_shop     7 non-null object
Date_start    7 non-null datetime64[ns]
City          7 non-null object
Format        4 non-null object
SKU_Count     7 non-null int64
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 360.0+ bytes

In [10]:
df.Format.fillna('Супермаркет', inplace=True)
# Метод fillna обращаемся к стобцу формат и зполняет пустые ячейки

In [12]:
df.Format

0       Супермаркет
1    Магазин у дома
2       Гипермаркет
3       Супермаркет
4    Магазин у дома
5         Косметика
6       Супермаркет
Name: Format, dtype: object

In [14]:
df[['Format']]

           Format
0     Супермаркет
1  Магазин у дома
2     Гипермаркет
3     Супермаркет
4  Магазин у дома
5       Косметика
6     Супермаркет

In [15]:
df[['Name_shop','Format']]

       Name_shop          Format
0  Стремительный     Супермаркет
1    Хрустальный  Магазин у дома
2     Турбуленый     Гипермаркет
3        Опасный     Супермаркет
4        Полдний  Магазин у дома
5   Колоссальный       Косметика
6      Правдивый     Супермаркет

In [16]:
df.head

<bound method NDFrame.head of        Name_shop Date_start       City          Format  SKU_Count
0  Стремительный 2000-12-03    Москва      Супермаркет       1300
1    Хрустальный 1999-07-08  Волгоград  Магазин у дома       1000
2     Турбуленый 2000-02-13  Краснодар     Гипермаркет       3000
3        Опасный 2005-04-15  Краснодар     Супермаркет       1300
4        Полдний 2005-11-19     Москва  Магазин у дома       1000
5   Колоссальный 2005-05-31     Москва       Косметика       1500
6      Правдивый 2014-04-28     Москва     Супермаркет       1300>

In [18]:
df.tail

<bound method NDFrame.tail of        Name_shop Date_start       City          Format  SKU_Count
0  Стремительный 2000-12-03    Москва      Супермаркет       1300
1    Хрустальный 1999-07-08  Волгоград  Магазин у дома       1000
2     Турбуленый 2000-02-13  Краснодар     Гипермаркет       3000
3        Опасный 2005-04-15  Краснодар     Супермаркет       1300
4        Полдний 2005-11-19     Москва  Магазин у дома       1000
5   Колоссальный 2005-05-31     Москва       Косметика       1500
6      Правдивый 2014-04-28     Москва     Супермаркет       1300>

In [20]:
df[:2]
# Выводит первые 2 строки из списка

       Name_shop Date_start       City          Format  SKU_Count
0  Стремительный 2000-12-03    Москва      Супермаркет       1300
1    Хрустальный 1999-07-08  Волгоград  Магазин у дома       1000

In [21]:
df[-3:]
# Выводит последние 3 строки из списка

      Name_shop Date_start    City          Format  SKU_Count
4       Полдний 2005-11-19  Москва  Магазин у дома       1000
5  Колоссальный 2005-05-31  Москва       Косметика       1500
6     Правдивый 2014-04-28  Москва     Супермаркет       1300

In [23]:
df.loc[[1,3,5],['Name_shop','City']]
# Выводит 1,3,5 магазин

      Name_shop       City
1   Хрустальный  Волгоград
3       Опасный  Краснодар
5  Колоссальный     Москва

In [25]:
df.iloc[[1,3,5],[0,2]]
# Выводит 1,3,5 магазин

      Name_shop       City
1   Хрустальный  Волгоград
3       Опасный  Краснодар
5  Колоссальный     Москва

In [29]:
df[df.Date_start >= pd.datetime(2002,1,1)]
#Выводит магазины откыте после 2000 года

      Name_shop Date_start       City          Format  SKU_Count
3       Опасный 2005-04-15  Краснодар     Супермаркет       1300
4       Полдний 2005-11-19     Москва  Магазин у дома       1000
5  Колоссальный 2005-05-31     Москва       Косметика       1500
6     Правдивый 2014-04-28     Москва     Супермаркет       1300

In [30]:
df

       Name_shop Date_start       City          Format  SKU_Count
0  Стремительный 2000-12-03    Москва      Супермаркет       1300
1    Хрустальный 1999-07-08  Волгоград  Магазин у дома       1000
2     Турбуленый 2000-02-13  Краснодар     Гипермаркет       3000
3        Опасный 2005-04-15  Краснодар     Супермаркет       1300
4        Полдний 2005-11-19     Москва  Магазин у дома       1000
5   Колоссальный 2005-05-31     Москва       Косметика       1500
6      Правдивый 2014-04-28     Москва     Супермаркет       1300

In [31]:
df[(df.Date_start >= pd.datetime(2002,1,1)) & (df.City != 'Москва')]
# Выводит магаины которые открылись после 2000года не в МСК

  Name_shop Date_start       City       Format  SKU_Count
3   Опасный 2005-04-15  Краснодар  Супермаркет       1300

In [35]:
df[(df.Date_start >= pd.datetime(2002,1,1)) | (df.City == 'Волгоград')]

      Name_shop Date_start       City          Format  SKU_Count
1   Хрустальный 1999-07-08  Волгоград  Магазин у дома       1000
3       Опасный 2005-04-15  Краснодар     Супермаркет       1300
4       Полдний 2005-11-19     Москва  Магазин у дома       1000
5  Колоссальный 2005-05-31     Москва       Косметика       1500
6     Правдивый 2014-04-28     Москва     Супермаркет       1300